wiki/2017-03-02-emacs-mail-with-guns-on-windows.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>Mail with Gnus on Windows(Sacha Chua)</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">Mail with Gnus on Windows(Sacha Chua)</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#emacs"><div class="category">emacs</div></a> </div>
<div class="char-counter">2017-03-02</div>
        <div id="content">
<div class="RIGHT">
<p>
Posted on
November 20th, 2015
by Sacha Chua
</p>

</div>

<p>
Update 2015-11-26: fixed link to my config. Thanks, Thomas!
</p>

<p>
I use Gmail for my mail because it:
</p>

<ul class="org-ul">
<li>synchronizes with my phone, which is handy for notifications and quick replies</li>
<li>filters most of the spam for me</li>
<li>works with a few interesting extensions such as Boomerang for Gmail</li>
</ul>

<p>
However, I like the way the Gnus mail/news client in Emacs gives me a much more
keyboard-friendly way to manage lots of mail, and I can even write code to
partially automate some of my common operations.
</p>

<p>
I used to have my config in in ~/.gnus, but people might find it handy, so I’ve
added it to my public Emacs configuration.
</p>

<p>
I like using Gmane to read mailing lists, and I use IMAP to read my Gmail.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> gnus-select-method '(nnnil <span style="font-style: italic;">""</span>))
(<span style="font-weight: bold;">setq</span> gnus-secondary-select-methods
      '((nntp <span style="font-style: italic;">"news.gmane.org"</span>)
        (nnimap <span style="font-style: italic;">"imap.gmail.com"</span>
                (nnimap-address <span style="font-style: italic;">"imap.gmail.com"</span>)
                (nnimap-server-port 993)
                (nnimap-stream ssl)
                (nnimap-authenticator login))))
</pre>
</div>

<p>
I have two-factor authentication enabled for Gmail, so I set up an app-specific
password for Gnus. I have an ~/.authinfo file set up with something like:
</p>
<pre class="example">
&gt; machine imap.gmail.com login sacha@sachachua.com password mysecretapppassword
&gt; machine imap.gmail.com login sacha@sachachua.com password mysecretapppassword port 993
&gt; machine smtp.gmail.com login sacha@sachachua.com password mysecretapppassword port 587
</pre>

<p>
(I should probably get around to using GPG to automatically encrypt and decrypt
this file.)
</p>

<p>
Sending e-mail on Windows was a bit of a pain. Fortunately, I eventually found
something that works. I’ve configured emailrelay to accept the mail and forward
it to Gmail. The server starts with this batch file:
</p>

<pre class="example">
start "emailrelay" "C:\Program Files (x86)\emailrelay\emailrelay.exe" --as-proxy smtp.gmail.com:25 --client-auth "C:/sacha/.emailrelay" --client-tls --log --pid-file "C:\Program Files (x86)\emailrelay\emailrelay.pid" --spool-dir C:\sacha\tmp\emailrelay

</pre>

<p>
Sending queued mail works with this batch file:
</p>
<pre class="example">
"c:\Program Files (x86)\emailrelay\emailrelay.exe" --as-client smtp.gmail.com:587 --client-auth c:\sacha\.emailrelay --client-tls --spool-dir c:\sacha\tmp\emailrelay

</pre>

<p>
I should probably get around to using --as-proxy properly, since it still seems
to hold mail until I explicitly send it.
</p>

<p>
Some more config. Not sure how much of this is needed.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> message-send-mail-function 'smtpmail-send-it
      smtpmail-starttls-credentials '((<span style="font-style: italic;">"localhost"</span> 25 <span style="font-style: italic;">"sacha@local.sachachua.com"</span> nil))
      smtpmail-auth-credentials '((<span style="font-style: italic;">"localhost"</span> 25 <span style="font-style: italic;">"sacha@local.sachachua.com"</span> nil))
      smtpmail-default-smtp-server <span style="font-style: italic;">"localhost"</span>
      smtpmail-smtp-server <span style="font-style: italic;">"localhost"</span>
      smtpmail-smtp-service 25
      smtpmail-local-domain <span style="font-style: italic;">"local.sachachua.com"</span>)
(<span style="font-weight: bold;">setq</span> send-mail-function 'smtpmail-send-it)
(<span style="font-weight: bold;">setq</span> smtpmail-smtp-server <span style="font-style: italic;">"127.0.0.1"</span>)
(<span style="font-weight: bold;">setq</span> smtpmail-smtp-service 25)
(<span style="font-weight: bold;">setq</span> user-mail-address <span style="font-style: italic;">"sacha@sachachua.com"</span>)

</pre>
</div>

<p>
Hide HTML mail. I need to fiddle with this some more, since Gnus still tries to
display them. Sometimes my Gnus crashes when it tries to display HTML mail.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> mm-discouraged-alternatives
      '(<span style="font-style: italic;">"text/html"</span> <span style="font-style: italic;">"text/richtext"</span>)
      mm-automatic-display
      (-difference mm-automatic-display '(<span style="font-style: italic;">"text/html"</span> <span style="font-style: italic;">"text/enriched"</span> <span style="font-style: italic;">"text/richtext"</span>)))
</pre>
</div>

<p>
Hide quoted text.
</p>
<pre class="example">
(setq gnus-treat-hide-citation t)

</pre>

<p>
Get smarter about filtering depending on what I reed or mark. I use ! (tick) for
marking threads as something that interests me.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> gnus-use-adaptive-scoring t)
(<span style="font-weight: bold;">setq</span> gnus-default-adaptive-score-alist
     '((gnus-unread-mark)
       (gnus-ticked-mark (subject 10))
       (gnus-killed-mark (subject -5))
       (gnus-catchup-mark (subject -1))))

</pre>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
